[Oreans]

&New = Новый
&Open... = Открыть...
&Save = Сохранить
Save &As... = Сохранить как...
&Protect = Защитить
&Help = Помощь
About... = О программе...
Demo Version = Демо-версия
Save = Сохранить

Options = Опции
Application Information = Информация о Приложении
Protection Options = Опции Защиты
Code Replace = Замена Кода
Virtual Machine = Виртуальная Машина
Customized Dialogs = Изменененные Диалоги
Advanced Options = Продвинутые Опции
XBundler = XBundler
Help = Помощь
Registration = Регистрация
Trial Settings = Настройки Пробного Периода
Hardware Lock = Аппаратная Блокировка
Password Protection = Защита Паролем
Soft&ware = Программное Обеспечение
&Customers = Заказчики
&License Manager = Менеджер Лицензий
&Managers = Менеджеры
&Project = Проект
Tools = Инструменты
H&elp = Помощь
&Contents = Содержание
&About = О программе
Export Generators = Генераторы Экспорта
&Software = Программное Обеспечение
&License = Лицензирование
Password = Пароль
Trial Extension = Продление Пробного Периода
&Exit = Выход
P&rotect = Защита
Open Project = Открыть Проект
New Project = Новый Проект
Save Project = Сохранить Проект
Save Project As... = Сохранить Проект как...
Protect File = Защитить Файл
Dupli&cate = Сделать Копию
(Double click to select) = (Двойной шелчок для выбора)


Application = Приложение
Version = Версия
Input Filename = Входной Файл
Output Filename = Выходной Файл
File Size = Размер Файла
File Information = Информация о Файле
Get from version info = Взять из информации о версии
File not found = Файл не найден
Refresh = Обновить
Same as input = Такой же, как и входной

Advanced Anti-Debugger = Продвинутый Анти-отладчик
Enable Protection = Разрешить Защиту
Advanced API-Wrapping = Продвинутое сворачивание API
Anti Dumpers = Анти Дамперы
Entry Point Obfuscation = Скрытие Точки Входа
Anti-Patching = Анти-патчинг
None = Нет
File Patching = Патчинг Файла
Compression = Сжатие
Resources = Ресурсы
Monitor Blockers = Блокираторы Мониторинга
Files Monitors = Мониторинг Файлов
Registry Monitors = Мониторинг Реестра
Delphi/BCB Form Protection = Защита Форм Delphi/BCB
Memory Guard = Защита Памяти
Resources Encryption = Шифрование Ресурсов
VMWare/Virtual PC = VMWare/Virtual PC
Compatible = Совместимость
When Debugger Found = При Обнаружении Отладчика
Enable Encryption = Разрешить Шифрование
Display Message = Отображение Сообщения
Exit Silently = Тихое Завершение
Crash Application = Аварийное Завершение Приложения
Metamorph Security = Метаморфная Защита
Ring-0 Protection = Защита на Нулевом Кольце
(not available in DEMO) = (не доступно в Демо-версии)

Import = Импортировать
Export = Экспортировать
Reset Messages = Очистить Сообщения

Global Caption = Глобальная Надпись
Debugger found = Найден отладчик
Monitor software found = Найдено ПО мониторинга
Cracking tool found = Найдены инструменты для взлома
File corrupted = Файл поврежден
(Not displayed in this version) = (не показывается в этой версии)
Internal exception occured = Внутренняя ошибка
Virtual Machine Detected = Обнаружена Виртуальная Машина


Enable CodeReplace Technology = Активировать CodeReplace Технологию
Functions to remove using the CodeReplace Technology: = Функции, убирающие использование CodeReplace Технологии:
Assembly code inside function: = Ассемблирование кода внутри Функции:
Force simulation before protection = Принудитедьная Имитация перед защитой
Run with parameters = Запустить с параметрами
Start Simulation = Начать Имитацию

Virtual API-Wrapper = Виртуальный API-Сворачиватель
Imported DLLs: = Импортированные DLL:
Functions to Virtualize: = Функции для Виртуализации:
API Virtualization Level: = Уровень Виртуализации API:
Processor Specifications = Спецификации Процессора
Processor Type: = Тип процессора:
Multiprocessor: = Многопроцессорность:
Opcode Type: = Тип Опкода:
Dynamic Opcode: = Динамический Опкод:
VM Complexity: = Сложность ВМ:
VM size (aprox): = Размер ВМ (приблиз):
Execution Speed: = Скорость Выполнения:
Entry Point Virtualization = Виртуализация Точки Входа
Multi Branch Technology = Технология Multi Branch

Mutable CISC processor = Mutable CISC процессор
Mutable RISC-64 processor = Mutable RISC-64 процессор
Mutable RISC-128 processor = Mutable RISC-128 процессор
Mutable CISC-2 processor = Mutable CISC-2 процессор

Static opcodes = Статические опкоды
Metamorphic - Level 1 = Метаморфные - Уровень 1
Metamorphic - Level 2 = Метаморфные - Уровень 2
Metamorphic - Level 3 = Метаморфные - Уровень 3

Disabled = Отклбчено
20% Dynamic = 20% Динамических
40% Dynamic = 40% Динамических
60% Dynamic = 60% Динамических
80% Dynamic = 80% Динамических

Enable XBundler = Активировать XBundler
Make files visible to OpenDialog = Сделать файлы видимыми для функции OpenDialog
Allow bundling from any directory = Разрешить отсылку из любых директорий
AVI files support = Поддержка AVI файлов
Deleted extracted on exit = Удалять извлеченное при выходы
Files to bundle: (drag files here) = Файлы для отсылки: (перетащите сюда)
XBundler Options = Опции XBundler
Add File = Добавить Файл
Delete File = Удалить Файл

Filename = Имя Файла
Write to disk? = Записывать на диск?
Extraction Path (if written to disk) = Путь для Извлечения (при записи на диск)


Encrypt Application = Зашифровать Приложение
Protect as DLL Plugin = Защитить как DLL Плагин
Protect DLL plugin = Защитить DLL Плагин
Last Section Name = Имя Последней Сессии
.NET assemblies = сборки .NET
Active Context = Активный Контекст
Enable support = Активировать поддержку
Splash screen settings = Настройки титульного экрана
Mouse Click to proceed = Щелкните Мышкой чтобы продолжить
Display during a number of seconds = Отображать в течение нескольких секунд

This option will encrypt your protected application. You should never uncheck this option, only for debug purposes. = Эта опция шифрует ваше защищаемое приложение. Вы не должны отключать эту опцию, кроме случаев отладки.

Check this option only if your protected DLL will be used as plugin in third party software. = Выберите эту опцию только в том случае, если ваша защищаемая DLL будет исползоваться как плагин для стороннего приложения

You can change the name of the last section added by Themida = Вы можете изменить имя последней сессии, добавленной Themid'ой

This option should always be enabled to protect your .NET assemblies = Эта опция должна быть всегда включена для защиты ваших сборок .NET

Support for Active Context based DLLs = Поддержка для DLL базирующихся на Активном Контексте

Select a BMP-8 image that will be displayed when your application is launched = Выберите изображение в формате BMP-8, которое будет отображаться при запуске вашего приложения

The user must click in the Splash Screen to continue running the protected application = Пользователь должен нажать на Титульном Экране для продолжения запуска защищаемого приложения

The splash screen will be displayed for a custom number of seconds before continue running the protected application = Титульный Экран будет отображаться определенное количество секунд перед запуском защищаемого приложения

This option will enable Trial and Licensing protections in Ring-0, which will enhance the way that trial information is stored in the system. If you check this option, a device driver will be embedded and extracted automatically when your application runs. Notice that the Hardware ID is different if you enable or disable this option. = Эта опция активирует Защиты для Лицензирования и Пробного Периода на нулевом кольце, таким образом информация о Пробном Периоде сохраняется в системе по другому принципу. Если вы выберете эту опцию, драйвер устройства будет автоматически внедряться и распаковываться при запуске вашего приложения. Заметьте, что Hardware ID будет меняться при включении или выключении этой опции.


Reading SDK Macros = Макрос Чтение SDK
Redirecting and Encrypting SDK Macros = Макрос Перенаправление и Шифрование SDK
Merging sections / Preparing PE Header = Объединение секций / Подготовка PE Заголовка
Examining and Wrapping API Calls = Исследование и свертка API вызовов
Generating Unique SecureEngine Code = Генерация Уникального SecureEngine Кода 
Linking SecureEngine Code with Application = Связывание SecureEngine Кода с Приложением
Generating Unique Virtual Machine = Генерация Уникальной Виртуальной Машины
Compressing Virtual Machine = Сжатие Виртуальной Машины
Virtualizing VM / CodeReplace Macros = Макрос Виртуализация ВМ / CodeReplace
Compressing Application and Resources = Сжатие Приложения и Ресурсов
Encrypting Application and Resources = Шифрование Приложения и Ресурсов

Test Protected File = Тестировать Защищаемый Файл
Protect = Защитить
Cancel = Отмена
Play sound when protection finishes = Проиграть звук по завершению процесса защиты

This option supervises at any time if your application is running under any kind of debugger. = Эта опция наблюдает все время запущено ли ваше приложение в любом типе отладчика.
This option avoids your application from being dumped from memory to disk even using the most advanced memory dumping tools = Эта опция предохраняет ваше приложение от считывания из памяти на диск даже при использовании наиболее продвинутых утилит для Дампинга
This option removes and encrypts the entry point of your application, executing it from a secure place in memory = Эта опция удаляет и шифрует точку входа в ваше приложение, запуская его из защищенной области памяти
This option will keep your application resources fully encrypted against modifications = Эта опция полностью зашифрует ресурсы вашего приложения, предохраняя их от изменений
If you want that your application will run inside VMWare/VirtualPC you must check this option = Чтобы ваше приложение запускалось под VMWare/VirtualPC, вы должны выбрать эту опцию
This option will wrap the APIs used in your application to avoid a possible reconstruction of your original application = Эта опция будет прятать все API, использующиеся в вашем приложении, чтобы избежать возможной реконструкции оригинала приложения
This option detects if any modification is done to your protected application, either by a cracker or a virus = Эта опция определяет возможные изменения в вашем приложении, сделанные взломщиком или вирусом
This option will activate the internal Metamorph engine to generate multiples opcode mutations for a single block of code = Эта опция активирует внутренний Метаморфный движок для генерации множественных опкодовых мутаций для отдельного блока кода
This option will protect your application against memory patching = Эта опция будет защищать ваше приложение от патчинга памяти
This option allows you to choose the desired option to perform when a debugger or cracking tool has been found in memory = Эта опция позволит вам выбрать желаемый вариант поведения, когда будут найдены в памяти отладчик или утилита для взлома
This option keeps your application code compressed meanwhile it is not executed = Эта опция сохраняет ваше приложение в сжатом виде, когда оно не запущено
This option keeps the resources in your application fully compressed = Эта опция хранит все ресурсы приложения в сжатом виде
This option will compress the SecureEngine code that is appended into your protected application = Эта опция будет сжимать SecureEngine код, который добавляется к вашему приложению
This option will detect/fool possible files monitors when your protected application is running = Эта опция будет определять/дезориентировать возможные файловые мониторы во время работы вашего приложения
This option will detect/fool possible registry monitors when your protected application is running = Эта опция будет определять/дезориентировать возможные мониторы реестра во время работы вашего приложения
This option will protect your Delphi/BCB forms against reconstruction from memory. Note that this option is incompatible with some Delphi/BCB applications = Эта опция будет защищать ваши Delphi/BCB формы от реконструкции из памяти. Заметьте, что эта опция несовместима с некоторыми Delphi/BCB приложениями
Load your customized messages from a file = Загрузить из файла ваши измененные сообщения
Save your customized messages to a file = Сохранить в файл ваши измененные сообщения
This list displays all the DLLs imported by your application = Этот список отображает все DLL, импортированные вашим приложением
This list displays all the imported functions for the selected DLL. You can select which functions will be "virtualized" = Этот список отображает все импортируемые функции для выбранной DLL. Вы можете выбрать функции для "вмртуализации"
You can import API names from a text file. The imported APIs will be virtualized in the current project = Вы можете импортировать имена API из текстового файла. Импортированные API будут виртуализированы в текущем проекте
Select the maximun number of instructions to virtualize from your application entry point = Выбрать максимальное количество инструкций для виртуализации из точки входа вашего приложения.
This option will insert multiple conditional branch instructions inside your unique Virtual Machine, making it harder to analyze = Эта опция вставит многочисленные условные ветвления внутрь вашей уникальной Виртуальной Машины, делая ее более сложной для анализа
You can save the current selected APIs into a text file to be imported by another project = Вы можете сохранить текущие выбранные API в текстовый файл для импорта в другой проект
Complexity level to emulate each wrapped API = Уровень сложности эмуляции каждого сворачивания API

Changes have been made. Do you want to save project? = Были внесены изменения. Хотите ли вы сохранить проект?
Save Changes = Сохранить Изменения

*UNSAVED* = *НЕСОХРАНЕННЫЙ*
Invalid Project File. Please, recreate a new one = Файл Проекта Поврежден. Пожалуйста, создайте новый
Load Project = Загрузить Проект
You need XBundler .NET for your .NET application. Please contact info@oreans.com = Вам нужен XBundler .NET для ваших .NET приложений. Пожалуйста обратитесь на info@oreans.com
Sorry, Themida Standard cannot protect .NET files. You need to upgrade to Themida Professional for .NET support. Upgrade now? = Извините, но Themida Standard не может защищать .NET файлы. Вам нужно обновиться до Themida Professional для поддержки технологии .NET. Обновиться сейчас?
Save Project = Сохранить Проект
Save Project As... = Сохранить Проект Как...
No file selected. Please select a file to protect (Input Filename) =  Не выбран Файл. Пожалуйста выберите файл для защиты (Имя Входного Файла)
No Output file selected. Please select an Output file before protecting = Не задан выходной файл. Пожалуйста задайте выходной файл перед началм процесса защиты
File does not exists: = Файл не существует:
File is already protected/compressed: = Файл уже защищен/сжат:
File has invalid macros insertion: = Файл содержит некорректные макросы:
Please, review your macros again = Пожалуйста, просмотрите ваши макросы снова
File cannot be accessed for protection: = Файл недоступен для защиты:
Please select a new file to protect (Input Filename) = Пожалуйста выберите новый файл для защиты (Имя Входного Файла)
File has not being simulated. Please simulate the file before protection or uncheck the "Force simulation before protecting" checkbox = Файл не был имитирован. Пожалуйста имитируйте файл перед защитой или снимите опцию "Принудитедьная Имитация перед защитой"
Open Input File = Открыть Входной Файл
The resources section in your application is empty. Themida needs to rebuild your application header. Proceed? = 
Rebuild Header = Секция ресурсов вашего приложения пуста. Themida должна перестроить заголовок приложения. продолжить?
File is compressed or already protected: = Файл сжат или уже защищен:
Your application seems to be in use or running in memory. Please, make sure to close it before proceeding = 
Error = Ваше приложение возможно используется или запущено в памяти. Пожалуйста, убедитесь, что оно закрыто, перед тем как продолжить.
Your application header is incompatible with Themida. Do you want Themida to rebuild your application header? = 
.NET limitation = Заголовок вашего приложения несовместим с Themida. Хотите ли вы, чтобы Themida перестроила заголовок вашего приложения?
Sorry, you cannot change the global message caption in demo version = Извините, но вы не можете менять глобальный заголовок сообщений в демо-версии
Warning! The current CodeReplace macros are not valid for the selected file. CodeReplace macros removed = 
Warning = Внимание! Текущий CodeReplace макрос некорректен для выбранного файла. CodeReplace макрос удален
Warning! The current application is already protected/compressed. Do you still want to protect it? = Внимание! Текущее приложение уже защищено/сжато. Вы все еще хотите защитить его?
File has a missing macro START or END: = В файле отсутствует макрос START или END:
Please review your macros again = Пожалуйста просмотрите ваши макросы снова
File cannot be opened: = Файл не может быть открыт:
Make sure that other application is not using it = Убедитесь, что он не используется другим приложением
File to protect has an invalid PE header. Unable to inspect file = Защищаемый файл имеет неправильный PE-заголовок. Невозможно исследовать файл
File to protect contains one macro with few lines of code on it. Please review your macros again = Защищаемый файл содержит один макрос с несколькими строками кода в нем. Пожалуйста просмотрите ваши макросы снова
Sorry, the current version of Themida does not support CodeReplace in Visual Basic Pcode applications = Извините, но текущая версия Themida не поддерживает CodeReplace в приложениях, написанных в Visual Basic Pcode
Sorry, the current version of Themida does not support CodeReplace in .NET applications = Извините, но текущая версия Themida не поддерживает CodeReplace в .NET приложениях
Unable to find a function to add CodeReplace technology = Невозможно найти функцию для добавления технологии CodeReplace
Run with parameters = Запуск с параметрами
Please enter the parameters = Пожалуста введите параметры
Sorry, you cant disable that option in demo version = Извините, но вы не можете отключить эту опцию в демонстрационной версии
Messages exported to = Сообщения экспортированные в
Messages imported from = Сообщения импортированные из
Themida GUI Overview = Обзор интерфейса Themida
Protect Now = Защитить Сейчас
SecureEngine Technology = Технология SecureEngine
SecureEngine Macros = Макросы SecureEngine
Code Replace = Замена Кода
Software Updates = Обновления ПО
What is XBundler = Что такое XBundler
Using XBundler = Использование XBundler

Scenarios for Using XBundler = Сценарии для использования XBundler
*** ERROR: Project file does not exist or invalid. (Exit code 1) *** = *** ОШИБКА: Файл проекта некорректный или не существует (Код выхода 1) ***
*** ERROR: File to protect does not exist. (Exit code 2) *** = *** ОШИБКА: Защищаемый файл не существует (Код выхода 2) ***
*** ERROR: File is already protected. (Exit code 3) *** = *** ОШИБКА: Файл уже защищен (Код выхода 3) ***
*** ERROR: Error in SecureEngine macros. Please review them again. (Exit code 4) *** = *** ОШИБКА: Ошибка в макросах SecureEngine. Пожалуйста просмотрите их снова. (Код выхода 4) ***
*** ERROR: File to protect cannot be opened. (Exit code 2) *** = *** ОШИБКА: Невозможно открыть защищаемый файл (Код выхода 2) ***
*** ERROR: The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = *** ОШИБКА: Файл с заглавной картинкой имеет не 256 цветов. Только 256-цветные BMP-файлы будут отображаться правильно.
*** ERROR: The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = *** ERROR: Файл с заглавной картинкой имеет BMP-сжатие. Только несжатые BMP-файлы будут отображаться правильно.
Macros found: = Найдены макросы:
*** Fatal error while protecting file. (Exit Code 5) *** = *** Фатальная ошибка в процессе защиты файла. (Код выхода 5) ***
*** ERROR: Cannot write protected file. Make sure the file is not in use. (Exit code 6) *** = *** ОШИБКА: Невозможно записать в защищаемый файл. Убедитесь, что файл не используется. (Код выхода 6) ***
Generating Unique SecureEngine Code... = Генерируется Уникальный код SecureEngine...
Linking SecureEngine Code with Application... = Связывание кода SecureEngine с Приложением...
done. = выполнено.
Encrypting Application and Resources... = Шифрование Приложения и Ресурсов...
Compressing Application and Resources... = Сжатие Приложения и Ресурсов...
Macros processed: = Обработанные макросы:

processed: = обработано:
Application successfully protected. = Приложение успешно защищено.
Do you want to go to the order form Themida subscription plans? = Хотите ли вы пройти на форму заказа планов подписки Themida?
No file selected. Please, select a file to protect (Input Filename) = Файл не выбран. Пожалуйста, выберите файл для защиты (Имя Входного Файла)
Question = Вопрос
-- Files to Bundle -- = -- Файлы для Свертки --
The path of the file that you are inserting must be relative to: = Вставляемый путь к файлу должен быть относительным к:
All imported by ordinal! = Все импортировано по порядку!
Medium = Средний
Normal = Нормальный
High = Высокий
Supreme = Высочаший
Extreme = Экстремальный
Highest = Высший

This option is not enabled in DEMO version = Эта опция не доступна в демонстрационной версии
DEMO Restriction = Ограничение демонстрационной версии
The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = Файл с заглавной картинкой имеет не 256 цветов. Только 256-цветные BMP-файлы будут отображаться правильно.
The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = Файл с заглавной картинкой имеет BMP-сжатие. Только несжатые BMP-файлы будут отображаться правильно.
Sorry, Themida DEMO does not support RISC-128 processors = Извините, но Themida DEMO не поддерживает RISC-128 процессоры.
Processor Type = Тип Процессора
Sorry, Themida DEMO does not support Dynamic Opcodes = Извините, но Themida DEMO не поддерживает Динамические Опкоды
The file is never extracted to disk! = Файл не извлекался не диск!
Select file/s to bundle = Выберите файл/ы для упаковки
No file selected. Please, select a file to protect (Input Filename) = Файл не выбран. Пожалуйста, выберите файл для защиты (Имя Входного Файла)
Last Modified: = Последнее Изменение:
(Application header has been rebuilt by Themida) = (Заголовок приложения был перестроен Themida'ой)
File Type: Windows Standard Executable = Тип Файла: Стандартное приложение Windows
File Type: Visual Basic Native Executable = Тип Файла: Исполняемый файл Visual Basic Native
File Type: Visual Basic PCode Executable = Тип Файла: Исполняемый файл Visual Basic PCode
File Type: Windows .NET Executable = Тип Файла: Исполняемый файл Windows .NET
File Type: MACROMEDIA Executable = Тип Файла: Исполняемый файл MACROMEDIA
File Type: PowerBuilder Application = Тип Файла: Приложение PowerBuilder
File Type: Excelsior JET Application = Тип Файла: Приложение Excelsior JET
File Type: Dynamic Link Library (DLL) = Тип Файла: Динамическая библиотека (DLL)
File Type: OLE Control Extension (OCX) File = Тип Файла: Файл OLE Control Extension (OCX)
File Type: Screensaver File = Тип Файла: Файл хранителя экрана
File Type: Windows NT Service = Тип Файла: Служба Windows NT
File Type: Borland Library = Тип Файла: Библиотека Borland
File Type: Linux Executable (ELF/i386) = Тип Файла: Исполняемый файл Linux (ELF/i386)
File Type: NT Device Driver = Тип Файла: Драйвер устройства NT

*** Protected with Code Virtualizer *** = *** Защищено Виртуализатором Кода ***
Virtual Machine Macro Functions: = Макро-функции Виртуальной Машины
CodeReplace Macro Functions: = Макро-функции CodeReplace
CodeEncrypt Macro Functions: = Макро-функции CodeEncrypt
ClearCode Macro Functions: = Макро-функции ClearCode
Registered Macro Functions: = Зарегистрированные Макро-функции
Unregistered Macro Functions: = Незарегистрированные Макро-функции
Read functions automatically = Прочитать функции автоматически
Read functions from SDK = Прочитать функции из SDK
File already protected/compressed. = Файл уже защищен/сжат.
Error: There is a missing START or END in one of your macros. = Ошибка: Отсутствует START или END в одном из ваших макросов.
Error: Unable to open the selected file. File may be in use. = Ошибка: Невозможно открыть выбранный файл. Возможно файл уже используется.
Error: Invalid PE header in selected file. = Ошибка: Некорректный PE-заголовок в выбранном файле.
Error: The included code inside a macro is too small. = Ошибка: Включенный код внутри макроса слишком мал.
Error: There are at least a nested VM macros. VM macros cannot be nested. = Ошибка: присутствуют вложенные VM макросы. VM макросы не могут быть вложены.
Error: The selected file is not an x64 application. You need Themida x32 to protect that application. = Ошибка: Выбранный файл не является 64-битным приложением. Вам нужна 32-битная версия Themida для защиты этого приложения.
Error: The selected file is an x64 application. You need Themida x64 Edition to protect that application. = Ошибка: Выбранный файл является 64-битным приложением. Вам нужна 64-битная версия Themida для защиты этого приложения.
Project: = Проект:
Select functions from MAP file = Выбрать функции из MAP файла
Read functions automatically = Считать функции автоматически
How many functions do you want to add? = Сколько функций вы хотите добавить?
OK = OK
Sorry, the required MAP file was not found. Please, generate a MAP file for your application = Извините, но запрашиваемый MAP файл не был найден. Пожалуйста, сгенерируйте MAP файл для вашего приложения
There are not functions to simulate. Please, insert some functions either manually or automatically = Отсутствуют функции для имитации. Пожалуйста вставьте функции вручную или автоматически
Simulator = Имитатор
Information = Информация
None = Нет
Message = Сообщение
Customize Dialog = Диалог Изменения
Close = Закрыть

Internal Protection Messages = Встроенные Сообщения Защиты
Trial/Registration Messages = Сообщения Пробного периода/Регистрации
Will be displayed by WinLicense = Будут отображены с помощью WinLicense
Displayed by SDK or not displayed = Отображаются с помощью SDK или не отображаются
Cannot update oreans.sys driver (admin rights) = Невозможно обновить файл драйвера oreans.sys (права администратора)
Cannot open oreans.vxd driver (already in use) = Невозможно открыть файл драйвера oreans.vxd (уже используется)
Driver cannot be updated = Невозможно обновить драйвер
Computer needs to be reset to install driver = Необходимо перезагрузить компьютер для установки драйвера
Cannot write oreans.vxd (already in use) = Невозможна запись в файл драйвера oreans.vxd (уже используется)

Trial nag screen (reminder) = Окно напоминания Пробного периода
Trial days expired = Пробный период истек
Trial executions expired = Количество пробных запусков исчерпано
Trial date expired = Дата пробного периода истекла
Trial runtime expired = Время сеанса пробной версии истекло
Trial global time expired = Время работы пробной версии истекло
Trial locked to different country = Пробный доступ недоступен для вашей страны
Trial extension key corrupted = Ключ продления пробного периода поврежден
No more trial extensions allowed = Нельзя продлить пробный период
Show registration info (only first time when registered) = Показать регистрационную информацию (только первый раз во время регистрации)
License days expired = Срок лицензии истек
License executions expired = Количество запусков лицензии истекло
License date expired = Дата лицензии истекла
License global time expired = Общее время лицензии истекло
License key corrupted = Лицензионный ключ поврежден
License locked to different machine = Лицензия привязана к другому компьютеру
License without machine locking = Лицензия без привязки к оборудованию
No more hardware changes allowed = Нет доступа к изменению оборудования
Stolen license key = Ключ лицензии украден
License is not expirable = Бессрочная лицензия
License required to run = Лицензия требуемая для запуска
Trial/Licensing Manager manipulated =Регулируется менеджером Пробного периода/Лицензирования
Invalid user/password (for password dialog) = Неправильное имя пользователя/пароль (для диалога ввода пароля)

This application(s) will run in trial/restricted mode, until registered. = Это приложение будет запущено в ограниченном/пробном режиме до регистрации.
Days Expiration = Дней до окончания
Date Expiration = Дата окончания
Executions = Количество запусков
Run Time (execution) = Время работы сеанса (запуск)
Global Time = Общее время работы
days = дней
times = раз
minutes = минут
Unlimited = Бесконечно
(For custom restrictions) = (Для специальных ограничений)
Trial Restrictions = Ограничения пробного периода
Clock Change = Перевод часов
Trial Extension = Расширение пробного периода
Lock trial to user language = Привязать к языку пользователя
Allow trial period to be extended (with a valid key) = Разрешить продление пробного периода (с помощью корректного ключа)
Extension Key distribution options = Опции распространения ключа проделния пробного периода
With single file = Отделбный файл
With Registry = Реестр
Value Name = Имя параметра
Maximum Extensions = Максимальных Продлений
Maximum extensions allowed = Максимальных продлений разрешено

This option sets a trial period to a certain amount of days since the application is started for the first time = Эта опция устанавливает срок пробного периода на определенное количество дней после первого запуска приложения
This option sets an exact date for the end of the trial period = Эта опция устанавливает определенную дату окончания пробного периода
This option sets an exact number of executions allowed for an application = Эта опция устанавливает определенное количество разрешенных запусков приложения
This option sets an exact amount of time (in minutes) that an application can stay in memory = Эта опция устанавливает точное время (в минутах) нахождения приложения в памяти
This option sets an exact amount of total time (in minutes) that an application can run during all Windows® sessions = Эта опция устанавливает общее время работы приложения в Windows®
This option allows an application to run in trial mode without any restrictions added by WinLicense = Эта опция позволяет запускать приложение в пробном режиме без ограничений, накладываемых с помощью WinLicense
You can select how sensitive WinLicense will behave against clock changes. If for example, you select "1 day clock back", WinLicense will ignore if the clock has been turned back for 1 day. = Вы можете выбрать чувствительность WinLicense по отношению к переводу часов. Например при выборе "На день назад", WinLicense будет игнорировать перевод часов на один день.
This option allows an application to be locked to specific country when it runs in trial mode = Эта опция привязывает приложение, запущенное в пробном режиме, к определенной стране.
This option allows you to extend the trial period of your application with special trial extension keys = Эта опция позволяет продлить пробный период приложения с помощью специальных ключей продления.
This option sets the name of a trial extension file to be searched by WinLicense when the application is being started = Эта опция устанавливает имя файла продления пробного периода, который запросит WinLicense во время запуска приложения.
This option is used to allow distribution of extension keys as Windows® Registry key files = Эта опция позволяет распространять ключи продления пробного периода с помощью файлов реестра Windows®.
This option limits the amount of trial extensions that an application can be extended = Эта опция ограничивает количество продлений пробного периода приложения

Any clock change = Любое изменение часов
1 hour clock back = На час назад
1 day clock back = На день назад

This application(s) can be registered, with the presence of a valid key. = Это приложение может быть зарегистрировано с помощью корректного ключа.
This application(s) can be registered, with the presence of a valid key. = Это приложение может быть зарегистрировано с помощью корректного ключа.
License Keys Accepted = Ключи лицензии приняты
Types of accepted License Keys = Типы принятых ключей лицензии
Single file = Отдельный файл
Registry = Реестр
Security Options = Опции безопасности
Enable SmartActivate® System for user-side generated keys. = Включить систему SmartActivate® для ключей, сгенерированных пользователем.
Allow only hardware dependent (locked) registrations. = Разрешить только аппаратно-зависимые регистрации.
Accept only temporary keys (that expire). = Принимать только временные ключи (со сроком действия).
Application only runs when registered. (Requires a key to run) = Запуск только зарегистрированного приложения. (Требуется ключ для запуска)
Clear trial info when registered. = Удалить информацию о пробном периоде после регистрации.
License Key Signature = Подпись Ключа Лицензии
Level 1 = Уровень 1
Level 2 = Уровень 2
For professional and elegant licensing control, WinLicense offers the SmartActivate® System. This technology allows an application to be registered using SmartActivate® keys = Для профессионального и точного контроля за лицензированием, WinLicense предлагает систему SmartActivate®. Эта технология позволяет регистрировать приложение, используя ключи SmartActivate®
This option restricts the use of registration keys to a specific computer. As each computer has an unique machine ID (processor type, hard disk and BIOS serial), WinLicense can lock a registration key to that specific machine = Эта опция ограничивает использование ключей регистрации к определенному компьютеру. Так как каждый компьютер имет уникальный идентификатор (тип процессора, серийные номера BIOS и жесткого диска), то WinLicense может привязать ключ регистрации к данному компьютеру.
This option denies the use of "time unlimited" registration keys and forces WinLicense to accept only temporary registration keys = Эта опция запрещает использование "неограниченных по времени" ключей регистрации и заставляет WinLicense принимать только временные ключи регистрации
This option allows user to run an application only in the presence of a valid registration key. WinLicense will terminate the application if no key is found or if it is invalid = Эта опция позволяет пользователю запускать приложение только в присутствии с корректным регистрационным ключом. WinLicense закроет приложение, если ключ не будет найден или будет некорректен
The purpose of this option is to clear the trial information from a computer once an user receives a valid registration key and registers an application. If the user decides to remove the registration key or it expires, the trial period will restart from zero = Назначением этой опции является очистка информации о пробном периоде из компьютера, после того как пользователь получит регистрационный ключ и зарегистрирует приложение. Если пользователь решит удалить регистрационный ключ, или срок его действия истечет, пробный период начнется заново.
This option allows you to select the signature level used by WinLicense to check that licenses for your applications are genuine = Эта опция позволяет вам выбирать уровень подписи, используемый WinLicense для проверки того, что лицензия вашего приложения является подлинной

Enable Password Protection = Разрешить Защиту Паролем
Password requirement = Требования к паролю
Password Action = Действия с паролем
Encrypt EXE using the password hash. = Зашифровать EXE, используя хэш пароля
On Normal / Trial Version = На Нормальной/Пробной версии
On Registered Version = На зарегистрированной версии
Never ask for a password. = Никогда не запрашивать пароль.
I will ask for a password manually. = Я буду запрашивать пароль вручную.
Automatically, ask for a password only the first time. = Автоматически, запрашивать пароль только первый раз.
Automatically, always ask for a password. = Автоматически, всегда запрашивать пароль.

Hardware Lock = Оппаратная Привязка
Custom Hardware Items = Другие аппаратные части
Hardware Items = Аппаратные части
All hardware items = Все аппаратные части
CPU = CPU
BIOS = BIOS
MAC Address = MAC-адрес
HDD Serial = Серийный номер HDD
Allowed CPU changes = Разрешенные изменения CPU
Allowed BIOS changes = Разрешенные изменения BIOS
Allowed NIC changes = Разрешенные изменения NIC
Splash settings = Настройки всплесков

Keep Trial Running = Продолжать пробный запуск
Keep running = Продолжать запуск
Launch Application when Trial Expired = Запустить Приложение после завершения пробного периода
Launch Application = Запустить приложение
Application Name: = Имя приложения:
Enable Custom Event = Разрешить специальное событие
Export Specific Generators = Экспортировать специфичные генераторы
Event Name: = Имя события:
Export Generators = Генераторы экспорта
Custom Event = Специальное событие
This option will export a specific license generator when your application is being protected = Эта опция будет экспортировать специальный генератор лицензий во время процесса защиты вашего приложения
This option will run an external application when the trial period in your application has expired. = Эта опция запустит внешнее приложение, когда закончится пробный период вашего приложения.
You can define a custom event to exclude the initialization of several protected applications at the same time. This option is also suitable when your application is launched many times per minute. =  Вы можете задать специальное событие для исключения инициализации большого количества защищенных приложений в одно время. Эта опция также полезна, когда происходит многократный запуск вашего приложения в течение минуты.
Check this option if you want that your application continues running in trial mode if an invalid license key is present. =  Отметьте эту опцию, если вы хотите, чтобы ваше приложение продолжило работу в пробном режиме, если присутствует некорректный лицензионный ключ.
*** Demo Version *** = *** Демонстрационная Версия ***
Destroy Exports section = Уничтожить секцию экспорта
This option will destroy the export table of your DLL control for maximum security = Эта опция уничтожит таблицу экспорта вашей DLL управления для максимальной безопасности
Select specific functions from your DLL to handle each event = Выбрать функции из вашей DLL для контроля за каждым событием
DLL Control file = Файл управления DLL

Export specific generators to App. folder = Экспортировать специфичные генераторы в папку приложения
Trial in debug mode (for testing purposes) = Пробный период в режиме отладки (только для тестовых целей)
Check this option if you want to create a custom license generator for your protected application. The generator will be created in a subfolder inside your application folder. = Отметьте эту опцию, если вы хотите создать свой генератор лицензий для вашего защищаемого приложения. Генератор будет создан в поддиректории внутри директории вашего приложения.
Uncheck this option only when you are going to release your protected program. For testing purposes, leave this option checked to avoid storing unnecessary information in your system about your trial status. = Снимите эту опцию только, когда вы собираетесь публиковать вашу программу. Для тестовых целей оставьте эту опцию включенной, чтобы избежать записи ненужной информации в вашей системе о вашем статусе пробного периода.

&Add = Добавить
&Edit = Редактировать
&Delete = Удалить
Name = Имя
Company = Компания
Total Customers: = Всего Клиентов:
New Customer = Новый Клиент
Edit Customer = Редактировать Клиента
Delete Customer = Удалить Клиента
Customers = Клиенты
Extra Details = Дополнительные детали
Add Customer = Добавить Клиента
Update = Обновить
Filename = Имя файла
Version = Версия
Total Software: = Всего программ:
Do you want to delete this software? = Хотите ли вы удалить эту программу?
Confirm = Подтвердить
Add Software = Добавить программу
Edit Software = Редактировать программу
Delete Software = Удалить программу
Duplicate Software = Сделать копию программы
(leave blank to use the same input and output filename) = (оставьте пустым для использования одинаковых имен входного и выходного файлов)
Input File Type = Тип входного файла
License Unique Key = Уникальный лицензионный ключ
Trial Unique Key =  Уникальный ключ пробного периода
Password Unique Key = Уникальный парольный ключ
Windows Standard Executable (EXE) = Стандартный исполняемый файл Windows (EXE)
Dynamic Link Library (DLL) = Динамическая библиотека (DLL)
OLE Control Extension (OCX) = OLE Control Extension (OCX)
Windows .NET Executable = Исполняемый файл Windows .NET
Windows NT/XP Service = Служба Windows NT/XP
Screensaver File (SCR) = Файл хранителя экрана (SCR)
Copy Software = Копировать программу
Reg Unique Key missing. Please, select one. = Отсутствует уникальный регистрационный ключ. Пожалуйста, выберите его.
Software Manager = Менеджер ПО
Sofware name missing. Please, select one. = Отсутствует иммя программы. Пожалуйста, выберите его.
Reg Unique Key is too short. Please, select a new unique key. = Уникальный регистрационный ключ слишком короткий. Пожалуйста, выберите новый уникальный ключ.
Trial Unique Key missing. Please, select one. = Отсутствует уникальный ключ пробного периода. Пожалуйста, выберите его.
Trial Unique Key is too short. Please, select a new unique key. = Уникальный ключ пробного периода слишком короткий. Пожалуйста, выберите новый уникальный ключ.
Pass Unique Key missing. Please, select one. = Отсутствует парольный уникальный ключ пробного периода. Пожалуйста, выберите его.
Pass Unique Key is too short. Please, select a new unique key. = Парольный уникальный ключ слишком короткий. Пожалуйста, выберите новый уникальный ключ.
The software already exists in database. Please, choose a new software name or version. = Эта программа уже существует в базе данных. Пожалуйста выберите другое имя программы или версию.
A new License Hash is going to be created. Previous generated licenses will not work if you create a new hash. Proceed? = Будет создан новый хэш лицензий. Предыдущие сгенерированные лицензии не будут работать после генерации нового хэша. Продолжить?
Duplicated Software = Программа-дубликат
File cannot be opened. Make sure the application is not running or being used. = Невозможно открыть файл. Убедитесь, что приложение не запущено или не используется.
Protection Error = Ошибка защиты
Protect Error = Ошибка защиты
File is compressed or already protected. = Файл сжат или уже защищен
File has a missing macro START or END. Please correct this error before protecting. = В файле отсутствует макрос START или END. Пожалуйста, исправьте это перед началом процесса защиты.
File cannot be opened. Make sure that other application is not using it. = Файл не может быть открыт. Убедитесь, что он не используется другим приложением.
File has an invalid PE header. Unable to protect. = Файл имеет некорретный PE-заголовок. Невозможно защитить.
File contains one macro with few lines of code on it. Please review your macros before protecting. = Файл содержит один макрос с несколькими строками кода в нем. Пожалуйста просмотрите ваши макросы перед запуском процесса защиты.
File seems to be in use. Please, close the file to proceed with protection. = Возможно файл используется. Пожалуйста, закройте файл для продложения процесса защиты.
The splash file does not exist. = Файл с титульной картинкой не существует
Splash = Титульная картинка
The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = Файл с заглавной картинкой имеет не 256 цветов. Только 256-цветные BMP-файлы будут отображаться правильно.
The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = Файл с заглавной картинкой имеет BMP-сжатие. Только несжатые BMP-файлы будут отображаться правильно.
Do you want to cancel the protection process? = Хотите ли вы остановить процесс защиты?
Cannot open file to protect for writing. Please, make sure that the file is not being used or running. Protection aborted. = Невозможно открыть для записи защищаемывй файл. Пожалуйста, убедитесь, что файл не используется и не запущен. Процесс защиты прерван.
Cannot write protected file to disk. Please, make sure you have write permits and enough space in your disc. = Невозможно записать защищаемый файл на диск. Пожалуйста, убедитесь, что вы имеет необходимые привилегии для записи и достаточное количество места на диске.
Sorry, the DEMO version of WinLicense only allows protection with trial/licensing in debug mode = Извините, но демонстрационная версия WinLicense позволяет защищать Лицензированием/Пробным периодом только в режиме отладки
WinLicense DEMO = WinLicense DEMO

&Add License = Добавить Лицензию
&Edit License = Редактировать Лицензию
&Delete License = Удалить Лицензию
Create License Key = Создать Ключ Лицензии
Mark as Stolen = Пометить как украденный
Unmark Stolen = Пометить как неукраденный
Stolen = Украденный
Ban Hardware IDs = Заблокировать аппаратные идентификаторы
Please make a selection... = Пожалуйста, сделайте выбор...
License Details = Детали Лицензии
License Generation = Генерация Лицензии
Hardware ID = Аппаратный идентификатор
Custom Data = Дополнительный данные
Key Type = Тип Ключа
Country Locking = Привязка к стране
Store generated Licenses in folder: = Сохранять сгенерированные лицензии в папке:
Generate File Key = Сгенерировать файловый ключ
Generate Registry Key = Сгенерировать ключ реестра
Generate Text Key = Сгенерировать текстовый ключ
Generate SmartActivate Key = Сгенерировать SmartActivate ключ

Total Software: = Всего программ:
All = Все
Please make a selection... = Пожалуйста, сделайте выбор...
Nothing selected. = Ничего не выбрано
Selection: = Выьрано:
Software: = программа:
Do you want to mark the current key as stolen? = Хотите ли вы пометить данный ключ, как украденный?
Stolen Keys = Украденные ключи
Do you want to unmark the current key from being stolen? = Хотите ли вы снять пометку о краже данного ключа?
Do you want to delete this license? = Хотите ли вы удалить эту лицензию?
Warning: The generated keys will have the settings from the current project. Proceed? = Внимание: Сгенерированные ключи будут настроены в соответствии с текущим проектом. Продолжить?
Generate License = Сгенерировать Лицензию
Cannot create directory: = Невозможно создать директорию:
Please, select which type of license you want to generate = Пожалуйста, выберите тип генерируемой лицензии
Keys successfully generated in folder: = Ключи успешно сгенерированы в папке:
Please, first select a valid application to protect = Пожалуйста, сначала выберите корректное приложение для защиты
Ban Hardware Id = Заблокировать аппаратный идентификатор

License Restrictions = Ограничения Лицензии
Customer = Клиент
Software = Программа
Save = Сохранить
Edit License = Редактировать Лицензию
Add License = Добавить Лицензию
Please, select a customer from database. = Пожалуйста, выберите клиента из базы данных
License Manager = Менеджер Лицензий
Please, select a software from database. = Пожалуйста, выберите программу из базы данных.
Please, insert a Hardware ID for verification = Пожалуйста, вставьте аппаратный идентификатор для подтверждения
The inserted Hardware ID is valid = Данный аппаратный идентификатор корректен
Invalid Hardware ID inserted = Вставлен некорректный аппаратный идентификатор
Another instance of WinLicense is running = Запущен другой экземпляр WinLicense
You have enabled SmartActivate keys but you have not selected any type of License Keys accepted (Single file or Registry) Remember that you have to use WLRegSmartKeyInstallToFile or WLRegSmartKeyInstallToRegistry to finally install the SmartActivate key = Вы активировали ключи SmartActivate, но вы не выбрали тип принимаемых лицензионных ключей (в файле или в реестре) Запомните, что вы должны использовать WLRegSmartKeyInstallToFile или WLRegSmartKeyInstallToRegistry для окончательной установки ключей SmartActivate
File has not being simulated: = Файл не был симитирован
Please simulate the file before protection or uncheck the "Force simulation before protecting" checkbox = Пожалуйста, симитируйте файл перед началом процесса защиты или отключите опцию "Форсировать имитацию перед защитой"
Warning: Your application has been set up to be registered with a valid license key, but you have not selected any way of registration. If you continue, your application will not be able to be registered. Proceed? = Внимание: ваше приложение должно регистрироваться с применением корректного лицензионного ключа, но вы не выбрали тип регистрации. Если вы продолжите, ваше приложение невозможно будет зарегистрировать. Продолжить?
Warning: Your application has been set up to be extended with trial extension key, but you have not selected any way to extend the trial period. If you continue, your application will not be able to be extended. Proceed? = Внимание: ваше приложение поддерживает продление пробного периода, но вы не выбрали способ продления. Если вы продолжите, то невозможно будет дальнейшее продление пробного периода вашего приложения. Продолжить?
Your application header is incompatible with WinLicense. Do you want WinLicense to rebuild your application header? = Заголовок вашего приложения несовместим с WinLicense. Хотите ли вы, чтобы WinLicense перестроила заголовок вашего приложения?
Sorry, WinLicense Standard cannot protect .NET files. You need to upgrade to WinLicense Professional for .NET support. Upgrade now? = Извините, но WinLicense Standard не может защищать файлы .NET. Вам нужно обновиться до версии WinLicense Professional для поддержки .NET. Обновиться сейчас?
Note: CodeReplace has been added into your application = Учтите: CodeReplace был добавлен в ваше приложение
(Application header has been rebuilt by WinLicense) = (Заголовок приложения был перестроен с помощью WinLicense)
Error: The selected file is not an x64 application. You need WinLicense x32 to protect that application. = Ошибка: выбранный файл не является 64-битным приложением. Вам нужна 32-битная версия WinLicense для защиты этого приложения.
Error: The selected file is an x64 application. You need WinLicense x64 Edition to protect that application. = Ошибка: выбранный файл является 64-битным приложением. Вам нужна 64-битная версия WinLicense для защиты этого приложения.
Sorry, the MAP file was not found: = Извините, но MAP-файл не был найден:
Please, generate a MAP file for your application = Пожалуйста, сгенерируйте MAP-файл для вашего приложения
Sorry, the current version of WinLicense does not support CodeReplace in Visual Basic Pcode applicaitons = Извините, но текущая версия WinLicense не поддерживает CodeReplace в приложениях, написанных на Visual Basic Pcode
Sorry, the current version of WinLicense does not support CodeReplace in .NET applications = Извините, но текущая версия WinLicense не поддерживает CodeReplace в .NET приложениях
There are some functions highly executed and some not executed in simulation. Do you want to unselect those functions? = В имитации присутствуют крайне исполняемые и не исполняемые функции. Хотите ли вы снять выбор с этих функций?
There are some functions highly executed in simulation. Do you want to unselect those functions? = В имитации присутствуют крайне исполняемые функции. Хотите ли вы снять выбор с этих функций?
There are some functions not executed in simulation. Do you want to unselect those functions? = В имитации присутствуют не исполняемые функции. Хотите ли вы снять выбор с этих функций?
Messages exported to: = Сообщения экспортируемые в
Messages imported from: = Сообщения импортируемые из
WinLicense GUI Overview = Обзор WinLicense GUI
Trial Settings = Параметры пробного периода
Trial SDK = Trial SDK
Registration SDK = Registration SDK
Password Protection = Защита паролем
Miscellaneous SDK = Разные SDK
Hardware Lock = Аппаратная привязка
WARNING: Protected in Trial Debug Mode = ВНИМАНИЕ: Защищенный файл в режиме отладки
Click and select here = Нажмите и выделите здесь
ERROR: None of the functions handlers where specified in DLL Control = ОШИБКА: Ни один из обработчиков функций не был определен в DLL управления
Sorry, WinLicense DEMO does not support RISC-128 processors = Извините, но демонстрационная версия WinLicense не поддерживает процессоры RISC-128
Sorry, WinLicense DEMO does not support Dynamic Opcodes = Извините, но демонстрационная версия WinLicense не поддерживает динамические опкоды
Signature Level 2 is not accepted for the current Software. Please, go to the Sofware Panel and re-create a new License Hash for your software = Нельзя применить Подписи 2 уровня для этой программы. Пожалуйста, зайдите в панель программ и пересоздайте хэш лицензий для вашей программы
.NET Module = Модуль .NET
File has a missing macro START or END. Please review your macros again: = В файле отсутствует макрос START или END. Пожалуйста просмотрите ваши макросы снова:
File cannot be opened. Make sure that other application is not using it: = Невозможно открыть файл. Убедитесь, что файл не используется другим приложением:
File has an invalid PE header. Unable to inspect file: = Файл имеет некорректный PE-заголовок. Невозможно исследовать файл:
File contains one macro with few lines of code on it. Please review your macros again: = Файл содержит один макрос с несколькими строками кода в нем. Пожалуйста просмотрите ваши макросы снова:
Deep file analysis in progress = В процессе глубокого файлового анализа
File analysis in progress = В процессе файлового анализа
Please wait... = Пожалуйста, ждите...
Analyzing CodeReplace macros = Анализируются макросы CodeReplace
Are you sure you want to remove the selected Hardware ID? = Вы уверены в том, что хотите удалить выбранный аппаратный идентификатор?
List of Banned  Hardware IDs: = Список заблокированнных аппаратных идентификаторов:
Add = Добавить
Remove = Удалить
Done = Сделано
Generating License Hash = Генерируется хэш лицензий
Generate Password = Сгенерировать пароль
Password Generation = Генерация пароля
Store generated Passwords in folder: = Поместить сгенерированные пароли в папку:
Total Passwords: = Всего паролей:
Do you want to delete the selected record? = Вы уверены в том, что хотите удалить текущую запись?
Password file generated in folder: = Файл паролей сгенерирован в папке:
Password Generator = Генератор паролей
Password Manager = Менеджер паролей
Details = Детали

Add Password = Добавить пароль
Edit Password = Редактировать пароль
Please, select a customer to generate the password = Пожалуйста, выберите клиента для генерации пароля
Please, select a software to generate the password = Пожалуйста, выберите программу для генерации пароля
Rolling back your actions = Откат ваших действий

Generate Extension = Сгенерировать продление
Level = Уровень
Trial Extension Generation = Генерация продления пробного периода
Store generated Extensions in folder: = Поместить сгенерированные продления в папку:
Generate File Key = Сгенерировать файловый ключ
Generate Registry Key = Сгенерировать ключ реестра
Trial extension key/s generated in folder: = Ключ/и продления пробного периода сгенерированы в папке:
Trial Extension Generator = Генератор продлений пробного периода
Edit = Редактировать
Add Trial Extension = Добавить продление
Edit Trial Extension = Редактировать продление
Please, select a software to generate the trial extension = Пожалуйста, выберите программу для генерации продления

Warning: Trial in Debug Mode = Внимание: пробный период в режиме отладки
Debug Mode Trial = Отладка пробного периода
The application that you are going to protect will not include the SecureEngine Trial Storing Manager*. = Приложение, которое вы собираетесь защитить не будет содержать менеджера хранения пробного периода SecureEngine*.
The trial information will be stored under the registry key: = Информация о пробном периоде будет храниться в реестре:
(You can access to that key to reset/test the WinLicense Trial Engine) = (Вы можете получить доступ к этому ключу для сброса/тестирования WinLicense Trial Engine)
*To enable the SecureEngine Trial Storing Manager, uncheck the option "Trial in debug mode" in the Protect screen. = *Чтобы активировать менеджер хранения пробного периода SecureEngine, отключите опцию "Отладка пробного периода" на экране защиты.
Don't show this screen again = Не показывать снова

Do you want to delete the selected client? = Вы хотите удалить выделенного клиента?
Enter new Hardware ID to ban: = введите новый аппаратный идентификатор для блокировки:
The entered Hardware ID does not seem to be valid (must be at least 32 chars) Please, enter a valid Hardware ID = Введенный аппаратный идентификатор не является правильным (должно быть минимум 32 символа) Пожалуйста, введите корректный аппаратный идентификатор

File has a missing macro START or END. Please correct this error before protecting: = В файле отсутствует макрос START или END. Пожалуйста, исправьте это перед началом процесса защиты:
File has an invalid PE header. Unable to protect: = Файл имеет некорретный PE-заголовок. Невозможно защитить:
File contains one macro with few lines of code on it. Please review your macros before protecting: = Файл содержит один макрос с несколькими строками кода в нем. Пожалуйста просмотрите ваши макросы перед запуском процесса защиты:
The input file seems to be in use. Please, close the file to proceed with protection: = Возможно входной файл используется. Пожалуйста, закройте файл для продложения процесса защиты:

Code Virtualization = Виртуализация кода
Virtual Opcodes Obfuscation = Скрытие виртуальных опкодов
Current: = Текущий:
Virtual Machine Complexity = Сложность виртуальной машины
Size (Approx): = Размер (приблиз):
Opcodes Mutation = Мутация Опкодов
Multiple Virtual Machines = Множество Виртуальных Машин
NumVMs * SizeVM: = ЧислоВМ * РазмерВМ
Fake Stack Emulation = Эмуляция испорченного стека
Strip Relocations (EXEs) = Показать Смещения (EXEs)
Strip relocations = Показать смещения
Re-Virtualization = Ре-виртуализация
Multi Branch Technology = Технология Multi Branch
Fake Emulation = Поддельная эмуляция
Keep original name = Сохранять оригинальное имя
Functions that will be virtualized: = Функции для виртуализации:

You can customize how complex will be the Virtual Machine opcodes. The size of the generated opcodes depend on the complexity selected = Вы можете изменить сложность опкодов Виртуальной Машины. Размер сгенерированных опкодов зависит от их сложности
You can customize how complex the generated virtual machine will be. The size of the virtual machine depends on the complexity that you select = Вы можете изменить сложность Виртуальной Машины. Размер Виртуальной Машины зависит от выбранной вами сложности
You can mutate the internal virtual opcodes, generating a more complex virtual machine = Вы можете применить мутации к внутренним виртуальным опкодам, что увеличит сложность виртуальной машины
The generad Virtual Machine and virtual opcodes will be placed inside the last section of your application. You can rename the last section of your application as desired = Сгенерированные Виртуальная Машина и виртуальные опкоды будут помещаться в последней секции вашего приложения. Вы можете переименовать последнюю секцию вашего приложения
You can create several Virtual Machines inside your protected application. Each Virtual Machine will process specific blocks of code in your application = Вы можете создать несколько Виртуальных Машин внутри вашего приложения. Каждая из них будет обрабатывать определенные блоки кода в вашем приложении
This option will assume the stack to be initilized to zero for all not allocated entries in stack. This option should be enabled for PureBasic applications = Эта опция синициализирует стэк на ноль для всех не размещенных записей в стеке. Эта опция должна быть включена для приложений PureBasic
You can remove the relocations section from the PE header for EXE files, reducing the size of the final protected application = Вы можете удалить секцию смещений из PE-заголовка для исполняемых файлов, снижая окончательный размер защищаемого приложения
Re-Virtualization is an extremely powerful technique against Reverse Engineering. But it can decrease a lot the performance in speed in the protected blocks.  Please, check the performance of your application when protected with Re-Virtualization = Ре-Виртуализация эта мощнейшая технология против техники Обратной Инженерии. Но, это может привести к значительному снижению производительности в защищенных блоках. Пожалуйста, проверьте производительность вашего приложения, защищенного технологией Ре-Виртуализации
This option will insert multiple conditional branch instructions inside your unique virtual machine, making it harder to analyse = Эта опция вставит многочисленные условные ветвления внутрь вашей уникальной виртуальной машины, делая ее более сложной для анализа

Please, select an application to protect = Пожалуйста, выберите защищаемое приложение
The selected application does not have any functions to virtualize. Please insert functions using the SDK = Выбранное приложение не имеет функций для виртуализации. Пожалуйста, вставьте функции, используя SDK
All functions to virtualize were disabled. Please, select at least one = Все функции для виртуализации были отключены. Пожалуйста, выберите хотя бы одну
Warning! A macro with no code inside has been found. This might be due to compiler optimizations. Please, disable your compiler optimizations or review each macro. = Внимание! Бвыл обнаружен пустой макрос. Это могло произойти из за оптимизации компилятора. Пожалуйста, отключите оптимизации вашего компилятора или просмотрите каждый макрос.
Virtual Functions = Виртуальные Функции
Inserted via "Call VarPtr": = Вставлено, используя "Вызов VarPtr":
Inserted via inline Assembly: = Вставлено, используя встроенный Ассемблер:
Inserted via auxiliar API: = Вставлено, используя вспомогательный API:
Inserted via MAP file: = Вставлено через MAP-файл:
NO FUNCTIONS FOUND TO VIRTUALIZE!!! = НЕ НАЙДЕНО ФУНКЦИЙ ДЛЯ ВИРТУАЛИЗАЦИИ!!!
(Application header has been rebuilt by Code Virtualizer) = (Заголовок приложения был перестроен с помощью Виртуализатора Кода)
Protecting an Application = Защищается приложение
Learn About Virtualizer = Узнайте о Виртуализаторе
Code Virtualization = Виртуализация Кода
Code Virtualize Macros = Макросы Виртуализации Кода
**** Sorry, the DEMO version does not support protection via command line **** = **** Извините, но демонстрационная версия не поддерживает защиту в командной строке ***
*** ERROR: File to protect cannot be acccessed. (Exit code 2) *** = *** ОШИБКА: Нет доступа к защищаемому файлу. (Код ошибки 2) ***
*** ERROR: File does not have any blocks to protect. (Exit code 3) *** = *** ОШИБКА: Файл не содержит блоков для защиты. (Код ошибки 3) ***
*** ERROR: File to protect cannot be opened. (Exit code 5) *** = *** ОШИБКА: Невозможно открыть защищаемый файл. (Код ошибки 5) ***
Generating Specific Virtual Machine = Генерируется Специфичная Виртуальная Машина
Virtualizing Function = Виртуализация функций
Re-Virtualizing ... = Ре-Виртуализация...
Flushing file ... = Сбрасывается файл...
Sorry, the DEMO version only allows one Virtual Machine per application = Извините, но демонстрационная версия поддерживает только одну Виртуальную Машину на приложение
Sorry, the DEMO version does not support Re-Virtualization = Извините, но демонстрационная версия не поддерживает Ре-Виртуализацию
The application is already protected. You cannot protect an already protected application in the DEMO version = Приложение уже защищено. Вы не можете защитить уже защищенное приложение в демонстрационной версии
The Input application cannot be accessed. Please, check that the application is not in use: = Нет доступа к входному приложению. Пожалуйста, убедитесь, что приложение не используется:
The Output application cannot be accessed. Please, check that the application path is valid or file is not in use: = Нет доступа к выходному приложению. Пожалуйста, убедитесь, что путь задан правильно или, что приложение не используется:
Limitations in DEMO version: = Ограничения в демонстрационной версии:
Virtual Opcodes Obfuscation set to NORMAL = Скрытие Виртуальных Опкодов установлено на НОРМАЛЬНОЕ
Virtual Machine Complexity set to NORMAL = Сложность Виртуальной Машины установлена на НОРМАЛЬНАЯ
Only ONE macro is virtualized = Только один макрос для виртуализации
The Output application cannot be accessed. Please, check that the application is not in use: = Нет доступа к выходному приложению. Пожалуйста, убедитесь, что приложение не используется:
PE Information = PE информация:
Input PE file: = Входной PE файл:
Output PE file: = Выходной PE файл:
Virtual Functions found: = Виртуальные Функции найдены:
PE file analysis... OK! = Анализ PE файла... OK!
Virtualization = Виртуализация
Generating Specific Virtual Machine = Генерируется Специфичная Виртуальная Машина
Size: = Размер:
Virtualizing Function = Виртуализация функций
Start: = Старт:
Skipped = Пропущено
bytes = байт
Cancelling... = Отмена...
Re-Virtualization = Ре-Виртуализация
Re-Virtualizing ... = Ре-Виртуализация...
Final Stats = Финальная статистика
Virtualized Functions: = Виртуализировано функций:
Skipped Functions: = Пропущено функций:
Errors: = Ошибки:
Increase in size: = Увеличение размера:
Application successfully protected! = Приложение успешно защищено!
Protection CANCELLED! = Защита ОТМЕНЕНА!
Do you really want to Cancel the protection process? = Вы действительно хотите остановить процесс защиты?
Cancel Protection = Отменить защиту

Select a Software to protect from the WinLicense database = Выберите приложение для защиты из базы данных WinLicense


Anti-Debugger Detection = 
Advanced = 
Disable = 
Level 1 = 
Level 2 = 
File Patch (sign support) = 
Detect any change = 
Allow 1 hour back = 
Allow 1 day back = 
Allow clock changes = 
External Hardware = 
U3 USB device = 
(not Windows 9x/Me compatible) = 
Periodically check U3 device = 
The U3 USB device will be monitored to check if it's unplugged. The function WLHardwareRuntimeCheckU3 checks if the device is present or not at any time. = 
Checking U3 USB device = 
Network Instances: No more Allowed = 
Network Instances: Server not running = 
** Not available in current version ** = 
License installation time-limit exceeded = 
License disabled in current instance = 
Control Messages from external DLL = 
Select a DLL that will handle the displaying of each message. If no DLL is selected, Themida will display the above messages in a MessageBox =  
Functions Handlers = 
Select the function in your DLL that will handle the protection messages = 
Select the DLL that will handle all WinLicense events = 
Hide from PE scanners = 
Type 1 = 
Type 2 = 
Localization = 
Add Manifest = 
Don't add manifest = 
Add Custom manifest = 
MSVC80 manifest = 
XP Themes = 
MSVC90 manifest = 
Launch Application = 
This option will run an external application when the trial period in your application has expired. = 
Delete extracted on exit = 
Open Project = 
Description = 
Saved Projects = 
Date Created = 
Delete = 
Open = 
Reset Trial = 
Reset Trial in current machine = 
Search = 
Search Next = 
Install Before Date = 
Network Instances = 
Instances = 
Store Creation Date = 
Embed user info in key =  
(only for Dynamic SmartKeys) = 
Generate Dynamic SmartKey = 
Default License generation folder = 
License Restrictions = 
Miscellaneous = 
Search Details = 
Search by: = 
Search for: = 
Customer Name = 
GetPrivateProfile APIs support = 